Revit 2027 API
FabricArea.RemoveFabricReinforcementSystem Method
 Deletes the specified FabricArea, and converts its FabricSheet elements to equivalent Single Fabric Sheet elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> RemoveFabricReinforcementSystem(
	Document doc,
	FabricArea system
)
Public Shared Function RemoveFabricReinforcementSystem (
	doc As Document,
	system As FabricArea
) As IList(Of ElementId)
public:
static IList<ElementId^>^ RemoveFabricReinforcementSystem(
	Document^ doc,
	FabricArea^ system
)
static member RemoveFabricReinforcementSystem :
        doc : Document *
        system : FabricArea -> IList<ElementId>
Parameters
doc Document
 The document.
system FabricArea
 An FabricArea Reinforcement element in the document.
Return Value
IList<ElementId>
 The ids of the newly created Single Fabric Sheet elements.
Exceptions
Exception | Condition
ArgumentException |  The element system was not found in the given document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace